ThisIsNotRocketScience/Syntonovo_PAN/controller/usbmidiio/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M4F */
void BOARD_InitPins(void)
{
    /* Enables the clock for the IOCON block. 0 = Disable; 1 = Enable.: 0x01u */
    CLOCK_EnableClock(kCLOCK_Iocon);
    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);
    /* Enables the clock for the GPIO1 module */
    CLOCK_EnableClock(kCLOCK_Gpio1);

    gpio_pin_config_t T6_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_8 (pin 64)  */
    GPIO_PinInit(BOARD_INITPINS_T6_GPIO, BOARD_INITPINS_T6_PORT, BOARD_INITPINS_T6_PIN, &T6_config);

    gpio_pin_config_t BR3_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_13 (pin 67)  */
    GPIO_PinInit(BOARD_INITPINS_BR3_GPIO, BOARD_INITPINS_BR3_PORT, BOARD_INITPINS_BR3_PIN, &BR3_config);

    gpio_pin_config_t MK4_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_14 (pin 69)  */
    GPIO_PinInit(BOARD_INITPINS_MK4_GPIO, BOARD_INITPINS_MK4_PORT, BOARD_INITPINS_MK4_PIN, &MK4_config);

    gpio_pin_config_t BR2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_17 (pin 70)  */
    GPIO_PinInit(BOARD_INITPINS_BR2_GPIO, BOARD_INITPINS_BR2_PORT, BOARD_INITPINS_BR2_PIN, &BR2_config);

    gpio_pin_config_t BR4_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_18 (pin 72)  */
    GPIO_PinInit(BOARD_INITPINS_BR4_GPIO, BOARD_INITPINS_BR4_PORT, BOARD_INITPINS_BR4_PIN, &BR4_config);

    gpio_pin_config_t T3_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_24 (pin 38)  */
    GPIO_PinInit(BOARD_INITPINS_T3_GPIO, BOARD_INITPINS_T3_PORT, BOARD_INITPINS_T3_PIN, &T3_config);

    gpio_pin_config_t T2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_25 (pin 40)  */
    GPIO_PinInit(BOARD_INITPINS_T2_GPIO, BOARD_INITPINS_T2_PORT, BOARD_INITPINS_T2_PIN, &T2_config);

    gpio_pin_config_t MK1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_27 (pin 42)  */
    GPIO_PinInit(BOARD_INITPINS_MK1_GPIO, BOARD_INITPINS_MK1_PORT, BOARD_INITPINS_MK1_PIN, &MK1_config);

    gpio_pin_config_t BR0_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_28 (pin 44)  */
    GPIO_PinInit(BOARD_INITPINS_BR0_GPIO, BOARD_INITPINS_BR0_PORT, BOARD_INITPINS_BR0_PIN, &BR0_config);

    gpio_pin_config_t RASPI_DETECT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_3 (pin 60)  */
    GPIO_PinInit(BOARD_INITPINS_RASPI_DETECT_GPIO, BOARD_INITPINS_RASPI_DETECT_PORT, BOARD_INITPINS_RASPI_DETECT_PIN, &RASPI_DETECT_config);

    gpio_pin_config_t T4_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_8 (pin 36)  */
    GPIO_PinInit(BOARD_INITPINS_T4_GPIO, BOARD_INITPINS_T4_PORT, BOARD_INITPINS_T4_PIN, &T4_config);

    gpio_pin_config_t BR1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_9 (pin 39)  */
    GPIO_PinInit(BOARD_INITPINS_BR1_GPIO, BOARD_INITPINS_BR1_PORT, BOARD_INITPINS_BR1_PIN, &BR1_config);

    gpio_pin_config_t MK0_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_17 (pin 47)  */
    GPIO_PinInit(BOARD_INITPINS_MK0_GPIO, BOARD_INITPINS_MK0_PORT, BOARD_INITPINS_MK0_PIN, &MK0_config);

    gpio_pin_config_t MK2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_21 (pin 37)  */
    GPIO_PinInit(BOARD_INITPINS_MK2_GPIO, BOARD_INITPINS_MK2_PORT, BOARD_INITPINS_MK2_PIN, &MK2_config);

    gpio_pin_config_t T1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_22 (pin 43)  */
    GPIO_PinInit(BOARD_INITPINS_T1_GPIO, BOARD_INITPINS_T1_PORT, BOARD_INITPINS_T1_PIN, &T1_config);

    gpio_pin_config_t T0_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_23 (pin 46)  */
    GPIO_PinInit(BOARD_INITPINS_T0_GPIO, BOARD_INITPINS_T0_PORT, BOARD_INITPINS_T0_PIN, &T0_config);

    gpio_pin_config_t MK3_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_26 (pin 63)  */
    GPIO_PinInit(BOARD_INITPINS_MK3_GPIO, BOARD_INITPINS_MK3_PORT, BOARD_INITPINS_MK3_PIN, &MK3_config);

    gpio_pin_config_t T7_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_27 (pin 68)  */
    GPIO_PinInit(BOARD_INITPINS_T7_GPIO, BOARD_INITPINS_T7_PORT, BOARD_INITPINS_T7_PIN, &T7_config);

    gpio_pin_config_t T5_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_28 (pin 73)  */
    GPIO_PinInit(BOARD_INITPINS_T5_GPIO, BOARD_INITPINS_T5_PORT, BOARD_INITPINS_T5_PIN, &T5_config);

    IOCON->PIO[0][13] = ((IOCON->PIO[0][13] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT013 (pin 67) is configured as PIO0_13. */
                         | IOCON_PIO_FUNC(PIO013_FUNC_ALT0)

                         /* Select Analog/Digital mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO013_DIGIMODE_DIGITAL));

